d-x-l/test/day18/资料/0.96寸OLED模块资料/0.96OLED显示屏测试程序/OLED(STM32F103C8T6)/User/delay.c
#include "stm32f10x.h"
#include "delay.h"
static u8  fac_us=0;//us延时倍乘数
static u16 fac_ms=0;//ms延时倍乘数

//初始化延迟函数
//当使用ucos的时候,此函数会初始化ucos的时钟节拍
//SYSTICK的时钟固定为HCLK时钟的1/8
//SYSCLK:系统时钟
void DelayInit()
{
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);	//选择外部时钟  HCLK/8 不选择系统时钟是为了更稳定
//		SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);	//选择外部时钟  HCLK/8 不选择系统时钟是为了更稳定
	fac_us=SystemCoreClock/8000000;	//为系统时钟的1/8    9
	fac_ms=(u16)fac_us*1000;//非ucos下,代表每个ms需要的systick时钟数   9000
}
/****/
//延时nus
//nus为要延时的us数.		    								   
void DelayUs(unsigned long nus)
{		
	u32 temp;	    	 
	SysTick->LOAD=nus*fac_us;                          //时间加载	  		 
	SysTick->VAL=0x00;                                 //清空计数器
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;           //开始倒数	SysTick_CTRL_ENABLE_Msk 是1  查看寄存器就是开计数器的意思
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));             //等待时间到达   这个寄存器的17位 是标志位   temp&0x01这个就是为了更稳不至于让计时器贸然出现问题
	
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;       //关闭计数器
	SysTick->VAL =0X00;       //清空计数器	 
}
//延时nms
//注意nms的范围
//SysTick->LOAD为24位寄存器,所以,最大延时为:
//nms<=0xffffff*8*1000/SYSCLK
//SYSCLK单位为Hz,nms单位为ms
//对72M条件下,nms<=1864 
void DelayMs(unsigned int nms)
{
	u32 temp;
	SysTick->LOAD=(u32)nms*fac_ms;//时间加载(SysTick->LOAD为24bit)
	SysTick->VAL =0x00;           //清空计数器
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;          //开始倒数  
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));//等待时间到达
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;       //关闭计数器
	SysTick->VAL =0X00;       //清空计数器
}

void DelayS(unsigned int ns)//延时秒
{
	unsigned char i;
	for(i=0;i<ns;i++)
	{
		DelayMs(1000);
	}
}
